lvx/base/InformationRegisters/ИсторияИспользованияПараметровГенерацииШтрихкодовИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИспользованияПараметровГенерацииШтрихкодовИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрыГенерацииШтрихкодов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ХешСуммаУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/ИсторияИспользованияПараметровГенерацииШтрихкодовИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанных

Функция ПолучитьПараметрыГенерацииШтрихкодовИзИстории(ХешСуммы) Экспорт
	
	ПараметрыГенерацииШтрихкодов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ХешСуммы", ХешСуммы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	История.ХешСуммаУпаковки,
	|	История.ПараметрыГенерацииШтрихкодов
	|ИЗ
	|	РегистрСведений.ИсторияИспользованияПараметровГенерацииШтрихкодовИСМП КАК История
	|ГДЕ
	|	История.ХешСуммаУпаковки В (&ХешСуммы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыГенерацииШтрихкодов.Вставить(Выборка.ХешСуммаУпаковки, Выборка.ПараметрыГенерацииШтрихкодов.Получить());
	КонецЦикла;
	
	Возврат ПараметрыГенерацииШтрихкодов;
	
КонецФункции

#КонецОбласти

#Область ИзменениеДанных

Процедура ЗаписатьПараметрыГенерацииШтрихкодовВИсторию(ПараметрыГенерацииШтрихкодов) Экспорт
	
	Если ПараметрыГенерацииШтрихкодов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ХешСуммаУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Для Каждого КлючИЗначение Из ПараметрыГенерацииШтрихкодов Цикл
		Строка = Таблица.Добавить();
		Строка.ХешСуммаУпаковки = КлючИЗначение.Ключ;
	КонецЦикла;
	
	БлокировкаЗаписей = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаЗаписей.Добавить("РегистрСведений.ИсторияИспользованияПараметровГенерацииШтрихкодовИСМП");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Таблица;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХешСуммаУпаковки", "ХешСуммаУпаковки");
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаЗаписей.Заблокировать();
		
		Для Каждого КлючИЗначение Из ПараметрыГенерацииШтрихкодов Цикл
			
			Запись = РегистрыСведений.ИсторияИспользованияПараметровГенерацииШтрихкодовИСМП.СоздатьМенеджерЗаписи();
			Запись.ХешСуммаУпаковки             = КлючИЗначение.Ключ;
			Запись.ПараметрыГенерацииШтрихкодов = Новый ХранилищеЗначения(КлючИЗначение.Значение);
			Запись.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
